[
  {
    "path": "posts/2021-02-25-westernmonarchbutterflies/",
    "title": "western monarch butterflies",
    "description": "My Shiny App term project.",
    "author": [
      {
        "name": "Haley Grant",
        "url": {}
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\nToday, Western Monarch Butterfly counts are at an historic low. We’ve seen a steep drop in population size in the past few years and counts fell sharply in 2020. Someday soon the butterfly could go extinct in the American west.\nIt’s up to us whether or not they can recover. Monarchs, like many species, are most threatened by loss of habitat. Much of California has been developed and the native plants Monarchs need are not as common.\nNot only that, but non-native invasive species worsen the problem. These species typically have different blooming times which attract Monarchs and disrupt their traditional migration pattern. This is dangerous for Monarchs because it can prevent them from reaching critical overwintering sites.\nCalifornia land-owners are privileged to be able to choose what grows on their property, but this privilege also comes with a responsibility to plant native species. In order to save the Western Monarch Butterfly, those of us who own or have access to land need to plant the correct species to give Monarchs some of their habitat back.\nOur Shiny App aims to inform about this issue and also explain where native species should be grown. It will have reactive graphs that illustrate trends in population counts over time. We will also include a list common native milkweeds and visualize spatially where they grow.\nData and information for this project was provided by the Western Monarch Count, the Xerces Society for Invertebrate Conservation, and the Monarch and Milkweed Mapper Database.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-25T13:13:39-08:00",
    "input_file": "westernmonarchbutterflies.utf8.md"
  },
  {
    "path": "posts/2021-01-22-welcome/",
    "title": "welcome",
    "description": "My personal website.",
    "author": [
      {
        "name": "Haley Grant",
        "url": {}
      }
    ],
    "date": "2021-01-22",
    "categories": [],
    "contents": "\nI made this website for Advanced Data Science at UCSB’s Bren School, using Distill’s Postcards package. I hope you like it!\nDistill is a publication format for scientific and technical writing, native to the web.\nLearn more about using Distill at https://rstudio.github.io/distill.\nColor palette: https://www.canva.com/colors/color-palettes/berry-woodsy-day/\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-25T12:23:17-08:00",
    "input_file": {}
  }
]
